#Дана строка. Подсчитать количество содержащихся в ней цифр
a = int(input('Введите строку: '))
print(len(str(a)))