initial_items = [
            (101, "Samsung", "Телевизор", 45000.0, 15, 5),
            (102, "LG", "Телевизор", 38000.0, 3, 5),
            (103, "Apple", "Смартфон", 99000.0, 20, 8),
            (104, "Xiaomi", "Смартфон", 19000.0, 25, 10),
            (105, "Bosch", "Холодильник", 55000.0, 4, 5),
            (106, "Sony", "Наушники", 15000.0, 30, 7),
            (107, "Asus", "Ноутбук", 72000.0, 12, 4),
            (108, "Lenovo", "Ноутбук", 48000.0, 2, 5),
            (109, "Samsung", "Монитор", 18000.0, 8, 3),
            (110, "Xiaomi", "Самокат", 32000.0, 6, 2)
        ]